tutorials/reactiveTransport/reactiveTransportALEFoam/3DcalcitePost/constant/phreeqcReactions
TITLE Calcite- water


SOLUTION 0 formation water
     units   mg/L
	pH     2 
	temp    25.
        Ca     1e-13
        Cl 354.53
        C  1e-13


SELECTED_OUTPUT
-si Calcite

END



