tutorials/reactiveTransport/reactiveTransportALEFoam/3DcalcitePost/system/postProcessDict
FoamFile
{
version     4.0;
format      ascii;
class       dictionary;
location    "system";
object      postProcessDict;
}

x1 -1.0835e-3;
y1 -0.498e-3;
z1 -0.1e-3;

x2 1.5835e-3;
y2 0.998e-3;
z2 0.1e-3;

direction 0;
solidName movingWalls;
